txt_instruction = '''
Данний додаток дозволить вам за допомогою тесту Руф'є \n провести первинну діагностику вашого здоров'я. \n
Проба Руф'є являє собою комплекс навантажень, \n призначених для оцінки працездатності серця при фізичних навантаженнях. \n
У випробуваного визначають частоту пульсу за 15 секунд \n
Після цього протягом 45 секунд випробуваний виконує 30 присідань. \n
Після закінчення навантаження пульс підраховується знову: \n число пульсацій за перші 15 секунд, 30 секунд відпочинку, \n число пульсацій за останні 15 секунд. \n '''



txt_test1 = ''' Заміряйте пульс за 15 секунд. \n
Результат запишіть в відповідне поле.'''

txt_test2 = ''' Виконайте 30 присідань за 45 секунд. \n
Натисніть кнопку "Почати" для того, щоб запустити лічильник присідань.\n
Робіть присідання зі швидкістю лічильника.'''

txt_test3 = ''' Протягом хвилини заміряйте пульс два рази:\n 
за перші 15 секунд хвилини, потім за останні 15 секунд.\n
Результати запишіть в відповідні поля.''' 

txt_sits = "Виконайте 30 присідань за 45 секунд."